{"In a team project, what kind of role do you prefer to play? (e.g. leader, follower)": ["Both leader and follower, depending on the situation"], "Can you tell me the reasons?": ["I think it is important to sometimes take the lead, especially if your teammates are not willing to do so. But other times, I think it's important to follow the ideas of others and learn from them"], "on your project team?": ["People who can clearly and maturely communicate with me/the team"], "Why do you think so?": ["Because otherwise the team dynamic will be messy and not productive"], "What’s your leadership preference?": ["Shared Leadership"], "What’s your thinking style?": ["Detail-oriented"], "What are in your skill set? (e.g. programming, UI design, teamwork); How do you rate your skills?": ["programming - proficient, UI design - still learning but proficient, teamwork - still learning but proficient", "5"], "How will you describe your overall team experiences and how do you feel about it?": ["I think that it was a good opportunity to work with other people who do not have the same ideas as me. It was interesting talking with them about the project and seeing what kind of contributions we were all bringing to the table"], "How so?": ["The idea itself was a result of working with this specific team - a team member suggested a House Plant Waterer and we were all on board, even if I would have never thought to do that on my own"], "I hope I got your answer. Before moving on, anything else to add?": ["No"], "What kind of suggestions do you have to improve the teaming experience?": ["I think having more time in class to meet with team members and discuss the project would have helped"], "1. If you make a mistake on this team, it is often held against you.": ["Disagree"], "2. Members of this team are able to bring up problems and tough issues.": ["Neutral"], "3. People on this team sometimes reject others for being different.": ["Totally Disagree"], "4. It is safe to take a risk on this team.": ["Agree"], "5. It is difficult to ask other members of this team for help.": ["Disagree"], "6. No one on this team would deliberately act in a way that undermines my efforts.": ["Totally Agree"], "7. Working with members of this team, my unique skills and talents are valued and utilized.": ["Agree"], "1. Team members like each other": ["Neutral"], "2. Team members get along well. ": ["Agree"], "3. Team members enjoy spending time together ": ["Neutral"], "1. Our team is united in trying to reach its goals for performance": ["Agree"], "2.  I'm unhappy with my team's level of commitment to the task": ["Totally Disagree"], "3. Our team members have conflicting aspirations for the team's performance": ["Totally Disagree"], "1. Being part of the team allows team members to do enjoyable work. ": ["Neutral"], "2. Team members get to participate in enjoyable activities": ["Neutral", "Agree"], "1. How much relationship tension is there in your work group? ": ["1 (not at all)"], "2. How often do people get angry while working in your group?": ["1 (not at all)", "1 (not at all)"], "1. How much conflict of ideas is there in your work group?": ["2"], "2. How frequently do you have disagreements within your work group about the task of the project you are working on?": ["1 (not at all)"], "3. How often do people in your work group have conflicting opinions about the project you are working on?": ["2"], "1. How often are there disagreements about who should do what in your work group? ": ["1 (not at all)"], "2. How much conflict is there in your group about task responsibilities?": ["1 (not at all)", "2"], "Everyone has a gift. What is the best thing about you? For example, your top talent, skill, or anything else you are most proud of?": ["Dancer"], "Hm,  mind saying a bit more?": ["I am a dancer"], "What is an example that demonstrates your top quality?": ["I teach dance on a weekly basis"], "What is your biggest strength?": ["Being able to communicate"], "Could you tell me a bit more about it?": ["It is always helpful, especially in a group, to be able to express what I think and talk about what we are doing"], "Could you describe a concrete example where you applied your top strength?": ["When working in a group project for a class, none of the group members initiated any contact. I took the initiative and opened a conversation about what we needed to get done."], "What is your biggest weakness?": ["Being stubborn"], "If you don't mind, I'd like to hear a bit more.": ["It is sometimes easy for me to get stuck in my own ideas and think that they are the right ones, instead of being open to hear everyone's ideas"], "Can you describe your impression of me (Sam) in terms of three keywords?": ["automated curious neutral"], "Anything else?": ["No"], "Can you explain the reason why you choose these three keywords?": ["It seems clear that you are an automated interviewer, you ask a lot of followup questions, and there are no significant personality traits that I can pinpoint"], "What do you think of me in terms of likeable? Please give a rating on a scale of 1 to 5, 1 being not at all and 5 being very much.": ["3"], "Got it.": ["3"], "What do you think of me in terms of helpful? Please give a rating on a scale of 1 to 5, 1 being not at all and 5 being very much.": ["3"], "What do you think of me in terms of enjoyable? Please give a rating on a scale of 1 to 5, 1 being not at all and 5 being very much.": ["2"], "What do you think the perceived role of me is?": ["like a counselor", "1"], "How similar do you think you are to my personality?": ["1"], "What would you prefer?": ["Fill out a form"], "Any last thoughts or questions about our chat?  Feel free to share any comments about me.. I won't be offended at all :-)": ["No"], "name": "A"}